Tekla Open API Reference for Tekla Structures 2025
FormingStates.Wrapping Property
 Gets or sets the wrapping type.
 Namespace: Tekla.Structures.Forming
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WrappingType Wrapping { get; set; }
Public Property Wrapping As WrappingType
	Get
	Set
Property Value
Type: WrappingType
See Also
Reference
FormingStates Class
Tekla.Structures.Forming Namespace